slides/HW11-Mobile.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HW11-Mobile</title>
<!-- 2014-11-14 Fri 00:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jim Blomo" />
<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">HW11-Mobile</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Mobile Homework</a></li>
<li><a href="#sec-2">2. Mobile Layout</a>
<ul>
<li><a href="#sec-2-1">2.1. Flexible</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Page</a>
<ul>
<li><a href="#sec-3-1">3.1. TMTOWTDI</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Submit</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mobile Homework&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Create a dynamic page
</li>
<li>Respond to touch event
</li>
<li>Extra Credit: use another Javascript API
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Mobile Layout&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>3 columns (content of your choosing)
</li>
<li>As screen width shrinks, changes to 2 columns, then 1 column
</li>
<li><code>ontouchstart</code> column background color must change
</li>
</ul>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Flexible&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>We're now beyond starting with skeleton code, you guys should be able to
create pages from scratch
</li>
<li>If you use existing templates (HTML5Boilerplate) must comment
</li>
<li>You may use JS/CSS frameworks, but must write CSS with media queries
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Page&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Can be new, or from your portfolio, or from <code>app.py</code>
</li>
<li>May use "filler" content
</li>
<li>Columns should be <code>div</code>, kept aligned by <code>float:left</code> CSS
</li>
<li><a href="http://arnaudbrousseau.github.io/mobile-web-lecture-berkeley/rwd.html">media query demo</a>
</li>
</ul>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> TMTOWTDI&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>simplist, new page in public<sub>html</sub>
</li>
<li>Remember, if you use a template, please reference it in comments
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Submit&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Pull Request on GitHub
</li>
</ul>

<script type="text/javascript" src="production/org-html-slideshow.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jim Blomo</p>
<p class="date">Created: 2014-11-14 Fri 00:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.4)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
